// interview_record.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>

//
//求职过程记录
//

//
//2022.2.28
// 猎聘、智联，改简历（BOSS在审查无法注册）
// 
//电话聊
// 长川           看了下网评，有点差？
// 明度智云       医疗行业
// 华为OD         高级外包？
// 阳斯           给电网提供服务，评价一般
// 
// 还有一些猎头
//

//
//3.2 面完华为机考自投一部分
//
// 大华 主管拿了电话和邮箱 周六约时间电面
// 网易
// H3C
// 旷视科技
// 电鲸网络
// 同花顺
// 海康
// 奇盾 上海的技术说下周有机会来杭州聊一下
// 安恒 HR反馈 周一下午两点电面
//

//
//大华
// 约周六后没有面，3.7号下午四点半突然电面
// 等消息要不要二面，依然没约具体时间
//

//
//安恒
// 3.7 下午两点 电面
// 语言、网络、系统知识大部分能答得上
// 聊到了给offer多久能到岗
// 主要关心驱动方面，去的话是开发部，维护驱动模块
// 等后续
//

#include "huawei_od.hpp"
int main()
{
    longest_broadcast_response solution;
    solution.run();
}