// interview_record.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>

//
//求职过程记录
//

//
//2022.2.28
// 猎聘、智联，改简历（BOSS在审查无法注册）
// 
//电话聊
// 长川           看了下网评，有点差？
// 明度智云       医疗行业
// 华为OD         高级外包？
//

//
//华为OD
// 电话沟通后了解到OD就是先挂名其他企业，一年后有机会转正，也就是外包性质
// 据说转正概率并不高
// 
// 第一轮笔试，机考，发了练习题链接
// 编程练习题 
//  https://blog.csdn.net/armstronghappy/article/details/119236183
// 考试信息
// a 严格按照测试用例得分，第一题是简单点的两小题每题是100分；
// 第二题难点一题200分，第一题提交后不能返回，提交后才能看第二题，
// 时间总共2.5小时，控制时间，如果没有把握起码先把前两个题做了
// b 牛客网leetcode编程的时候输入输出是设置好的，但是实际考试过程需要自己写，
// 所以练习牛客网的时候用考试模式（进企业版在线考试试用），考试模式就需要自己写输入输出
// 
//关键字
// 刷题 试用考试模式 外包性质
//

int main()
{
    std::cout << "Hello World!\n";
}